# Вопросы для самопроверки

1. Что такое байт-код и почему он так важен для интернет-программирования на
языке Java?

    Ответ: Байт-код Java — набор инструкций, исполняемых виртуальной машиной Java. Каждый код операции байт-кода — один байт; используются не все 256 возможных значений кодов операций, 51 из них зарезервирован для использования в будущем. В большинстве случаев байт-код Java генерируется для исполнения на виртуальной машине Java из исходного кода на языке Java. Единственный оригинальный компилятор, преобразующий код на языке Java в байт-код Java — это Javac, созданный компанией Sun Microsystems. Но поскольку все спецификации байт-кода Java доступны, существуют и сторонние компиляторы, генерирующие этот байт-код.

2. Каковы три ключевых принuипа объектно-ориентированного программирования?

    Ответ: Инкапсуляция, полиморфизм и наследование.

3. С чего начинается выполнение программы на Java?

    Ответ: Входной точкой в программу на языке Java является метод main, который определен в классе Program. Именно с него начинается выполнение программы. Он обязательно должен присутствовать в программе. При этом его заголовок может быть только таким: ? 1 public static void main (String args []). При запуске приложения виртуальная машина Java ищет в главном классе программы метод main с подобным заголовком, и после его обнаружения запускает его.

4. Что такое переменная?

    Ответ: Переменная в Java — это контейнер, в котором может храниться некоторое значение данных для дальнейшего использования в программе. По сути переменная — это минимальная неделимая единица Java-приложения. Переменные в Java бывают двух видов: предназначенные для для маленьких данных (примитивные переменные) и для более сложных, тяжёлых (ссылочные переменные).

5. Какое из перечисленных ниже имен переменных недопустимо?
- А. count
- Б. $count
- В. count27
- Г. 67count

    Ответ: Недопустимо имя переменной 67count (пункт D). Имя переменной не может начинаться с цифры.

6. Как создаются однострочный и мноrострочный комментарии?

    Ответ: Однострочные комментарии должны начинаться с символов "//". В этом случае комментариями считаются эти и все последующие символы до конца строки. А многострочные комментарии должны начинаться символами /* и заканчиваться символами */.

7. Как выглядит общая форма условного оператора i f? Как выглядит общая форма
uикла for?

    Ответ: Общая форма оператора if выглядит следующим образом:

    - if (условие) оператор;

        А общая форма цикла for имеет следующий вид:

    - for (инициализация; условие; итерация) оператор;

8. Как создать блок кода?

    Ответ: Кодовый блок должен начинаться с символа { и завершаться символом }.

9. Сила тяжести на Луне составляет около 17% земной. Напишите программу, которая вычислила бы ваш вес на Луне.

    Ответ: 
    
        class WeightOnTheMoon {
        public static void main(String[] args) {
		double my_weight = 98;      
		double moon_gravity = 17;   
		double earth_gravity = 100; 
		double moon_weight;         
		moon_weight = (moon_gravity / earth_gravity) * my_weight;

		System.out.print("Мой вес на Луне равен: " + moon_weight + " кг.");
            }
    
        }


10. Если при вводе кода программы вы допустите опечатку, то какого рода сообщение
об ошибке получите?

    Ответ: Сообщение о синтаксической ошибке.

11. Имеет ли значение, с какой именно позиuии в строке начинается инструкuия?

    Ответ: Не имеет. В Java допускается произвольное форматирование исходного кода.